Documents/ПоступлениеПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоступлениеПлатежа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПоступления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвитанции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Владельцы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПоступлениеПлатежа/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
    Если Сумма <= 0 Тогда
        Сообщить("Сумма платежа должна быть больше нуля.");
        Отказ = Истина;
    КонецЕсли;
    Если НЕ Бокс.Пустая() И Собственник.Пустая() Тогда
        Сообщить("Для бокса " + Строка(Бокс) + " не найден собственник на дату платежа"
            + " (нет документа «Смена собственника»).");
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
    Движения.Взаиморасчеты.Записывать = Истина;
    Движение = Движения.Взаиморасчеты.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход; // погашение долга
    Движение.Период = Дата;
    Движение.Бокс = Бокс;
    Движение.Собственник = Собственник;
    Движение.Сумма = Сумма;
КонецПроцедуры
